УТ/src/Catalogs/CRM_ВидыВзаимодействий/CRM_ВидыВзаимодействий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>CRM_ВидыВзаимодействий</name>
  <comment>АПК:1034 не проверять на орфографию справку</comment>
  <predefined>
    <items>
      <name>Встреча</name>
      <description>Встреча</description>
    </items>
    <items>
      <name>ЛичнаяЗадача</name>
      <description>Задача</description>
    </items>
    <items>
      <name>ОбзвонКлиентов</name>
      <description>Обзвон клиентов</description>
    </items>
    <items>
      <name>ПотеряОбращения</name>
      <description>Потеря обращения</description>
    </items>
  </predefined>
  <attributes>
    <name>ВидСобытия</name>
    <type>
      <types>EnumRef.CRM_ВидыСобытий</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДела</name>
    <type>
      <types>CatalogRef.CRM_ВидыДелВзаимодействий</types>
    </type>
  </attributes>
  <attributes>
    <name>Направление</name>
    <type>
      <types>EnumRef.CRM_ВходящееИсходящееСобытие</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеИнтереса</name>
    <type>
      <types>CatalogRef.CRM_СостоянияИнтересов</types>
    </type>
  </attributes>
  <attributes>
    <name>Баллы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПланироватьАвтоматическиПриПереходеВСосотояние</name>
    <comment>АПК:265 не проверять на орфографию имя</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлановыйСрокДней</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПланироватьВЖурналеВстреч</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДлительностьВстречиПоУмолчанию</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонЧекЛиста</name>
    <type>
      <types>CatalogRef.CRM_ШаблоныЧекЛистаВзаимодействий</types>
    </type>
  </attributes>
  <attributes>
    <name>Тема</name>
    <comment>Тема взаимодействия</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

УТ/src/Catalogs/CRM_ВидыВзаимодействий/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

////////////////////////////////////////////////////////////////////////////////
// Обновление информационной базы.

Процедура ЗаполнитьПредопределенныеЭлементы() Экспорт
	
	СправочникОбъект					= Справочники.CRM_ВидыВзаимодействий.ЛичнаяЗадача.ПолучитьОбъект();
	СправочникОбъект.Баллы				= 0;
	СправочникОбъект.ВидДела			= Справочники.CRM_ВидыДелВзаимодействий.Задача_ЗадачаИсполнителя;
	Попытка
		СправочникОбъект.Записать();
	Исключение
		ЗаписьЖурналаРегистрации("Обновление конфигурации", УровеньЖурналаРегистрации.Ошибка,
			 Метаданные.Справочники.CRM_ВидыВзаимодействий,
			СправочникОбъект.Ссылка, НСтр("ru = 'Не удалось записать элемент справочника, при заполнении предопределенных элементов.'"));
	КонецПопытки;
	
	СправочникОбъект					= Справочники.CRM_ВидыВзаимодействий.Встреча.ПолучитьОбъект();
	СправочникОбъект.Баллы				= 18;
	СправочникОбъект.ВидДела			= Справочники.CRM_ВидыДелВзаимодействий.ПрочиеДокументы;
	СправочникОбъект.ВидСобытия			= Перечисления.CRM_ВидыСобытий.ЛичнаяВстреча;
	СправочникОбъект.Направление		= Перечисления.CRM_ВходящееИсходящееСобытие.Исходящее;
	СправочникОбъект.Описание			= Нстр("ru='Личная встреча';en='Personal meeting'");
	Попытка
		СправочникОбъект.Записать();
	Исключение
		ЗаписьЖурналаРегистрации("Обновление конфигурации", УровеньЖурналаРегистрации.Ошибка,
			 Метаданные.Справочники.CRM_ВидыВзаимодействий,
			СправочникОбъект.Ссылка, НСтр("ru = 'Не удалось записать элемент справочника, при заполнении предопределенных элементов.'"));
	КонецПопытки;
	
	СправочникОбъект					= Справочники.CRM_ВидыВзаимодействий.ОбзвонКлиентов.ПолучитьОбъект();
	СправочникОбъект.Баллы				= 1;
	СправочникОбъект.ВидДела			= Справочники.CRM_ВидыДелВзаимодействий.Документ_CRM_Интерес;
	СправочникОбъект.ВидСобытия			= Перечисления.CRM_ВидыСобытий.ТелефонныйЗвонок;
	СправочникОбъект.Направление		= Перечисления.CRM_ВходящееИсходящееСобытие.Исходящее;
	СправочникОбъект.Описание			= Нстр("ru='Обзвон клиентов по маркетинговой кампании';
		|en='Used to call the list of customers for a marketing campaign'");
	Попытка
		СправочникОбъект.Записать();
	Исключение
		ЗаписьЖурналаРегистрации("Обновление конфигурации", УровеньЖурналаРегистрации.Ошибка,
			 Метаданные.Справочники.CRM_ВидыВзаимодействий,
			СправочникОбъект.Ссылка, НСтр("ru = 'Не удалось записать элемент справочника, при заполнении предопределенных элементов.'"));
	КонецПопытки;
	
	СправочникОбъект					= Справочники.CRM_ВидыВзаимодействий.ПотеряОбращения.ПолучитьОбъект();
	СправочникОбъект.Баллы				= 0;
	СправочникОбъект.ВидДела			= Справочники.CRM_ВидыДелВзаимодействий.Документ_CRM_Интерес;
	СправочникОбъект.ВидСобытия			= Перечисления.CRM_ВидыСобытий.ТелефонныйЗвонок;
	СправочникОбъект.Направление		= Перечисления.CRM_ВходящееИсходящееСобытие.Входящее;
	СправочникОбъект.Описание			= Нстр("ru='Потеря обращения';en='Loss of Request'");
	Попытка
		СправочникОбъект.Записать();
	Исключение
		ЗаписьЖурналаРегистрации("Обновление конфигурации", УровеньЖурналаРегистрации.Ошибка,
			 Метаданные.Справочники.CRM_ВидыВзаимодействий,
			СправочникОбъект.Ссылка, НСтр("ru = 'Не удалось записать элемент справочника, при заполнении предопределенных элементов.'"));
	КонецПопытки;
	
	СправочникОбъект					= Справочники.CRM_ВидыВзаимодействий.СоздатьЭлемент();
	СправочникОбъект.Баллы				= 18;
	СправочникОбъект.ВидДела			= Справочники.CRM_ВидыДелВзаимодействий.Документ_CRM_Интерес;
	СправочникОбъект.ВидСобытия			= Перечисления.CRM_ВидыСобытий.ЛичнаяВстреча;
	СправочникОбъект.Наименование		= Нстр("ru='Личная встреча';en='Personal meeting'");
	СправочникОбъект.Направление		= Перечисления.CRM_ВходящееИсходящееСобытие.Исходящее;
	СправочникОбъект.Описание			= Нстр("ru='Личная встреча';en='Personal meeting'");
	Попытка
		СправочникОбъект.Записать();
	Исключение 
		ЗаписьЖурналаРегистрации("Обновление конфигурации", УровеньЖурналаРегистрации.Ошибка,
			 Метаданные.Справочники.CRM_ВидыВзаимодействий,
			СправочникОбъект.Ссылка, НСтр("ru = 'Не удалось записать элемент справочника, при заполнении предопределенных элементов.'"));
	КонецПопытки;
	
	СправочникОбъект					= Справочники.CRM_ВидыВзаимодействий.СоздатьЭлемент();
	СправочникОбъект.Баллы				= 2;
	СправочникОбъект.ВидДела			= Справочники.CRM_ВидыДелВзаимодействий.Документ_CRM_Интерес;
	СправочникОбъект.ВидСобытия			= Перечисления.CRM_ВидыСобытий.ТелефонныйЗвонок;
	СправочникОбъект.Наименование		= Нстр("ru='Телефонный звонок клиенту';en='Phone call to customer'");
	СправочникОбъект.Направление		= Перечисления.CRM_ВходящееИсходящееСобытие.Исходящее;
	СправочникОбъект.Описание			= Нстр("ru='Телефонный звонок клиенту';en='Phone call to customer'");
	Попытка
		СправочникОбъект.Записать();
	Исключение 
		ЗаписьЖурналаРегистрации("Обновление конфигурации", УровеньЖурналаРегистрации.Ошибка,
			 Метаданные.Справочники.CRM_ВидыВзаимодействий,
			СправочникОбъект.Ссылка, НСтр("ru = 'Не удалось записать элемент справочника, при заполнении предопределенных элементов.'"));
	КонецПопытки;
	
	СправочникОбъект					= Справочники.CRM_ВидыВзаимодействий.СоздатьЭлемент();
	СправочникОбъект.Баллы				= 2;
	СправочникОбъект.ВидДела			= Справочники.CRM_ВидыДелВзаимодействий.Документ_CRM_Интерес;
	СправочникОбъект.ВидСобытия			= Перечисления.CRM_ВидыСобытий.ЭлектронноеПисьмо;
	СправочникОбъект.Наименование		= Нстр("ru='Электронное письмо клиенту';en='Email to customer'");
	СправочникОбъект.Направление		= Перечисления.CRM_ВходящееИсходящееСобытие.Исходящее;
	СправочникОбъект.Описание			= Нстр("ru='Электронное письмо клиенту';en='Email to customer'");
	Попытка
		СправочникОбъект.Записать();
	Исключение 
		ЗаписьЖурналаРегистрации("Обновление конфигурации", УровеньЖурналаРегистрации.Ошибка,
			 Метаданные.Справочники.CRM_ВидыВзаимодействий,
			СправочникОбъект.Ссылка, НСтр("ru = 'Не удалось записать элемент справочника, при заполнении предопределенных элементов.'"));
	КонецПопытки;
	
	СправочникОбъект					= Справочники.CRM_ВидыВзаимодействий.СоздатьЭлемент();
	СправочникОбъект.Баллы				= 0;
	СправочникОбъект.ВидДела			= Справочники.CRM_ВидыДелВзаимодействий.Документ_CRM_Интерес;
	СправочникОбъект.ВидСобытия			= Перечисления.CRM_ВидыСобытий.ТелефонныйЗвонок;
	СправочникОбъект.Наименование		= Нстр("ru='Входящий телефонный звонок';en='Incoming phone call'");
	СправочникОбъект.Направление		= Перечисления.CRM_ВходящееИсходящееСобытие.Входящее;
	СправочникОбъект.Описание			= Нстр("ru='Входящий телефонный звонок';en='Incoming phone call'");
	Попытка
		СправочникОбъект.Записать();
	Исключение 
		ЗаписьЖурналаРегистрации("Обновление конфигурации", УровеньЖурналаРегистрации.Ошибка,
			 Метаданные.Справочники.CRM_ВидыВзаимодействий,
			СправочникОбъект.Ссылка, НСтр("ru = 'Не удалось записать элемент справочника, при заполнении предопределенных элементов.'"));
	КонецПопытки;
	
КонецПроцедуры

Функция ПолучитьАвтоСоздаваемыеПоСостояниюИнтереса(СостояниеИнтереса) Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	CRM_ВидыВзаимодействий.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Справочник.CRM_ВидыВзаимодействий КАК CRM_ВидыВзаимодействий
	                      |ГДЕ
	                      |	CRM_ВидыВзаимодействий.СостояниеИнтереса = &СостояниеИнтереса
	                      |	И CRM_ВидыВзаимодействий.ПланироватьАвтоматическиПриПереходеВСосотояние");
	Запрос.УстановитьПараметр("СостояниеИнтереса", СостояниеИнтереса);
	Результат = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли
